In [27]:
import pandas as pd
import numpy as np
import calendar as cl

In [2]:
folder = "C:/Users/fding/Desktop/BI Tasks/2020.5.29 - IHM Partner Project"
invoice_file = "/2020.5.1 ExtendTV Invoicing Master - Finance - Apr.xlsx"
order_file = "/Orders 5.29.xlsx"

In [3]:
invoice_16_6 = pd.read_excel(folder + invoice_file,'Invoices - June - 2016')
invoice_16_6 = invoice_16_6.rename(columns = {'Organzation':'Organization','Cost':'Total Cost'})
invoice_16_6 = invoice_16_6[(invoice_16_6['Organization'] == 'iHeartMedia') & (invoice_16_6['Total Cost'] > 0)][['Campaign Name','Billable Impressions','Total Cost']]
invoice_16_6.insert(0, 'Monthdate', '2016-06-01')
invoice_16_6.tail()

,Monthdate,Campaign Name,Billable Impressions,Total Cost
39,2016-06-01,BLVD_Treatment_Centers_June_2016_1103538064_Di...,197310,939.1956

In [4]:
invoice_16_7 = pd.read_excel(folder + invoice_file,'Invoices - July - 2016')
invoice_16_7 = invoice_16_7.rename(columns = {'Organzation':'Organization','Cost':'Total Cost'})
invoice_16_7 = invoice_16_7[(invoice_16_7['Organization'] == 'iHeartMedia') & (invoice_16_7['Total Cost'] > 0)][['Campaign Name','Billable Impressions','Total Cost']]
invoice_16_7.insert(0, 'Monthdate', '2016-07-01')
invoice_16_7.tail()

,Monthdate,Campaign Name,Billable Impressions,Total Cost
55,2016-07-01,Cindy_Youell_July_Aug_1108147146_Display_ETV,55718,260.20306
58,2016-07-01,BLVD_Treatment_Centers_June_2016_1103538064_Di...,555917,2646.16492
59,2016-07-01,Skydive_San_Diego_July_Sept 2016_1103538430_Di...,49629,231.76743
60,2016-07-01,Skydive_San_Diego_July_Sept_2016_1103538430_Di...,59086,275.93162
61,2016-07-01,Skydive_San_Diego_July_Sept_2016_1103538430_Video,30143,512.43100

In [7]:
invoice_16_8 = pd.read_excel(folder + invoice_file,'Invoices - August - 2016')
invoice_16_8 = invoice_16_8.rename(columns = {'Organzation':'Organization','Cost':'Total Cost'})
invoice_16_8 = invoice_16_8[(invoice_16_8['Organization'] == 'iHeartMedia') & (invoice_16_8['Total Cost'] > 0)][['Campaign Name','Billable Impressions','Total Cost']]
invoice_16_8.insert(0, 'Monthdate', '2016-08-01')
invoice_16_8.tail()

,Monthdate,Campaign Name,Billable Impressions,Total Cost
85,2016-08-01,Skydive_San_Diego_July_Sept 2016_1103538430_Di...,51367,239.88389
86,2016-08-01,Skydive_San_Diego_July_Sept_2016_1103538430_Di...,54635,255.14545
87,2016-08-01,Skydive_San_Diego_July_Sept_2016_1103538430_Video,29416,500.07200
88,2016-08-01,Coronado_Distribution_Company_1103543249_Display,66323,358.14420
89,2016-08-01,Coronado_Distribution_Company_1103543249_Displ...,168150,672.60000

In [9]:
invoice_16_9 = pd.read_excel(folder + invoice_file,'Invoices - September - 2016')
invoice_16_9 = invoice_16_9.rename(columns = {'Organzation':'Organization','Cost':'Total Cost'})
invoice_16_9 = invoice_16_9[(invoice_16_9['Organization'] == 'iHeartMedia') & (invoice_16_9['Total Cost'] > 0)][['Campaign Name','Billable Impressions','Total Cost']]
invoice_16_9.insert(0, 'Monthdate', '2016-09-01')
invoice_16_9.tail()

,Monthdate,Campaign Name,Billable Impressions,Total Cost
120,2016-09-01,Stay_In_Savannah_1110637482_Display_ETV,10297,41.18800
123,2016-09-01,Toledo_Museum_of_Art_1118432951_Display,10000,55.00000
124,2016-09-01,Toledo_Museum_of_Art_1118432951_Display_ETV,50000,200.00000
125,2016-09-01,Toledo_Museum_of_Art_1118433663_Display,73.7,0.40535
126,2016-09-01,Toledo_Museum_of_Art_1118433663_Display_ETV,109260,437.04000

In [11]:
invoice_16_10 = pd.read_excel(folder + invoice_file,'Invoices - October - 2016')
invoice_16_10 = invoice_16_10.rename(columns = {'Organzation':'Organization','Cost':'Total Cost'})
invoice_16_10 = invoice_16_10[(invoice_16_10['Organization'] == 'iHeartMedia') & (invoice_16_10['Total Cost'] > 0)][['Campaign Name','Billable Impressions','Total Cost']]
invoice_16_10.insert(0, 'Monthdate', '2016-10-01')
invoice_16_10.tail()

,Monthdate,Campaign Name,Billable Impressions,Total Cost
146,2016-10-01,Stay_In_Savannah_1110637482_Display_ETV,239703,958.8120
149,2016-10-01,Toledo_Museum_of_Art_1118433663_Display,21521,118.3655
150,2016-10-01,Toledo_Museum_of_Art_1118433663_Display_ETV,85338,341.3520
151,2016-10-01,Revelations_Haunted_Attraction_1118432987_Display,28500,152.1900
152,2016-10-01,Revelations_Haunted_Attraction_1118432987_Disp...,115125,460.5000

In [12]:
invoice_16_11 = pd.read_excel(folder + invoice_file,'Invoices - November - 2016')
invoice_16_11 = invoice_16_11.rename(columns = {'Organzation':'Organization','Cost':'Total Cost'})
invoice_16_11 = invoice_16_11[(invoice_16_11['Organization'] == 'iHeartMedia') & (invoice_16_11['Total Cost'] > 0)][['Campaign Name','Billable Impressions','Total Cost']]
invoice_16_11.insert(0, 'Monthdate', '2016-11-01')
invoice_16_11.tail()

,Monthdate,Campaign Name,Billable Impressions,Total Cost
205,2016-11-01,Jet_Jam_Night_of_Fire_1106358977_Display,49409,272.0
206,2016-11-01,Jet_Jam_Night_of_Fire_1106358977_Display_ETV,198415,794.0
207,2016-11-01,HART_1106359340_Display_ETV,165320,661.0
210,2016-11-01,Toledo_Museum_of_Art_1118433663_Display,8472.3,47.0
211,2016-11-01,Toledo_Museum_of_Art_1118433663_Display_ETV,33669,135.0

In [13]:
invoice_16_12 = pd.read_excel(folder + invoice_file,'Invoices - December - 2016')
invoice_16_12 = invoice_16_12.rename(columns = {'Organzation':'Organization','Cost':'Total Cost'})
invoice_16_12 = invoice_16_12[(invoice_16_12['Organization'] == 'iHeartMedia') & (invoice_16_12['Total Cost'] > 0)][['Campaign Name','Billable Impressions','Total Cost']]
invoice_16_12.insert(0, 'Monthdate', '2016-12-01')
invoice_16_12.tail()

,Monthdate,Campaign Name,Billable Impressions,Total Cost
198,2016-12-01,Goodrich_Free_Movie_Passes_DEC_1106362902_Display,40000,200.00000
199,2016-12-01,Goodrich_Free_Movie_Passes_DEC_1106362902_Disp...,60000,240.00000
202,2016-12-01,Hot995_Radio_17248_Display,4747475,25019.19325
203,2016-12-01,Hot995_Radio_17248_Display_ETV,5882353,25000.00025
204,2016-12-01,Hot995_Radio_17248_Video,586285,7914.84750

In [15]:
invoice_17_1 = pd.read_excel(folder + invoice_file,'Invoices - Jan - 2017')
invoice_17_1 = invoice_17_1.rename(columns = {'Cost':'Total Cost'})
invoice_17_1 = invoice_17_1[(invoice_17_1['Organization'] == 'iHeartMedia') & (invoice_17_1['Total Cost'] > 0)][['Campaign Name','Billable Impressions','Total Cost']]
invoice_17_1.insert(0, 'Monthdate', '2017-01-01')
invoice_17_1.tail()

,Monthdate,Campaign Name,Billable Impressions,Total Cost
217,2017-01-01,Kinetico_Water_Systems_1106831358_Display_ETV,60610,189.597656
220,2017-01-01,Flag_City_Furniture_1118446986_Display_ETV,41236,138.236309
223,2017-01-01,City_Blends_Smoothie_Cafe_1103842399_Display_ETV,1650,5.299072
226,2017-01-01,Sentara_1101647111_Display_ETV,403375,1313.230474
227,2017-01-01,WASH_FM_January_2017_1101647288_Display_ETV,11335583,37180.666898

In [16]:
summary_16 = pd.concat([invoice_16_6,invoice_16_7,invoice_16_8,invoice_16_9,invoice_16_10,invoice_16_11,invoice_16_12])
summary_16.shape[0]

546

In [17]:
invoice_17_2 = pd.read_excel(folder + invoice_file,'Invoices - Feb - 2017')
invoice_17_2 = invoice_17_2.rename(columns = {'Cost':'Total Cost'})
invoice_17_2 = invoice_17_2[(invoice_17_2['Organization'] == 'iHeartMedia') & (invoice_17_2['Total Cost'] > 0)][['Campaign Name','Billable Impressions','Total Cost']]
invoice_17_2.insert(0, 'Monthdate', '2017-02-01')
invoice_17_2.tail()

,Monthdate,Campaign Name,Billable Impressions,Total Cost
256,2017-02-01,Flag_City_Furniture_1118446986_Display_ETV,41901,148.171468
259,2017-02-01,City_Blends_Smoothie_Cafe_1103842399_Display_ETV,40187,130.071999
262,2017-02-01,WASH_FM_January_2017_1101647288_Display_ETV,4164417,13279.205302
263,2017-02-01,Sentara_1101647111_Display_ETV,355692,1185.050265
267,2017-02-01,Subway_1112251921_GF_Display,711578,3170.660808

In [18]:
invoice_17_3 = pd.read_excel(folder + invoice_file,'Invoices - Mar - 2017')
invoice_17_3 = invoice_17_3.rename(columns = {'Impressions':'Billable Impressions','Cost':'Total Cost'})
invoice_17_3 = invoice_17_3[(invoice_17_3['Organization'] == 'iHeartMedia') & (invoice_17_3['Total Cost'] > 0)][['Campaign Name','Billable Impressions','Total Cost']]
invoice_17_3.insert(0, 'Monthdate', '2017-03-01')
invoice_17_3.tail()

,Monthdate,Campaign Name,Billable Impressions,Total Cost
298,2017-03-01,DC101_Elliot_in_the_Morning_1101648836_Display...,2607725,4006.940614
299,2017-03-01,Office_of_Problem_Gambling_Awareness_Month_110...,407321,2068.659661
300,2017-03-01,Office_of_Problem_Gambling_Awareness_Month_110...,337803,1315.140083
301,2017-03-01,Visit_Orlando_In_State_1101648831_Display,230854,631.352531
302,2017-03-01,Visit_Orlando_Out_of_State_1101648831_Display,238884,650.715590

In [20]:
invoice_17_4 = pd.read_excel(folder + invoice_file,'Invoice - Apr -2017')
invoice_17_4 = invoice_17_4.rename(columns = {'Total cost':'Total Cost'})
invoice_17_4 = invoice_17_4[(invoice_17_4['Organization'] == 'iHeartMedia') & (invoice_17_4['Total Cost'] > 0)][['Campaign Name','Billable Impressions','Total Cost']]
invoice_17_4.insert(0, 'Monthdate', '2017-04-01')
invoice_17_4.tail()

,Monthdate,Campaign Name,Billable Impressions,Total Cost
2014,2017-04-01,DC101_Elliot_in_the_Morning_1101648836_Display...,440000,1721.064103
2022,2017-04-01,DC101_101_Minutes_1101648836_Display_ETV,7925495,16014.609397
2023,2017-04-01,DC101_Elliot_in_the_Morning_1101648836_Display...,2607725,4006.940614
2031,2017-04-01,DC101_101_Minutes_1101648836_Display_ETV,6165495,8185.631172
2032,2017-04-01,DC101_Elliot_in_the_Morning_1101648836_Display...,2167725,2285.876511

In [21]:
invoice_17_5 = pd.read_excel(folder + invoice_file,'Invoice - May - 2017')
invoice_17_5 = invoice_17_5.rename(columns = {'Total cost':'Total Cost'})
invoice_17_5 = invoice_17_5[(invoice_17_5['Organization'] == 'iHeartMedia') & (invoice_17_5['Total Cost'] > 0)][['Campaign Name','Billable Impressions','Total Cost']]
invoice_17_5.insert(0, 'Monthdate', '2017-05-01')
invoice_17_5.tail()

,Monthdate,Campaign Name,Billable Impressions,Total Cost
561,2017-05-01,Direct_Jewelry_Mothers_Day_1105948608_Display_ETV,26772,89.354525
562,2017-05-01,Pool_Boy_Direct_1105947873_Display_ETV,80610,278.690616
563,2017-05-01,Millstone_Farm_1105953969_Display_ETV,31445,110.572587
564,2017-05-01,Thelmas_Summer_2017_1105948309_Display,23840,66.569224
565,2017-05-01,Thelmas_Summer_2017_1105948309_Display_ETV,13126,49.121229

In [38]:
summary_16 = pd.concat([invoice_16_6,invoice_16_7,invoice_16_8,invoice_16_9,invoice_16_10,invoice_16_11,invoice_16_12])
summary_16.shape[0]

546

In [36]:
##2017-jun to dec
columns = ['Monthdate','Campaign Name','Billable Impressions','Total Cost']
summary_17 = pd.DataFrame(columns =columns )
for i in range(6,13):
    name  = 'invoice_17_' + str(i)
    locals()[name]=i
    name = pd.read_excel(folder + invoice_file, 'Invoice - ' + cl.month_abbr[i] + ' - 2017')
    name = name.rename(columns = {'Total cost':'Total Cost'})
    name = name[(name['Organization'] == 'iHeartMedia') & (name['Total Cost'] > 0)][['Campaign Name','Billable Impressions','Total Cost']]
    name.insert(0,'Monthdate','2017-0'+str(i)+'-01')
    summary_17 = summary_17.append(name,sort = False)

In [37]:
summary_17.shape[0]

4451

In [39]:
summary_17 = pd.concat([invoice_17_1,invoice_17_2,invoice_17_3,invoice_17_4,invoice_17_5,summary_17])
summary_17.shape[0]

5697

In [43]:
##2018
columns = ['Monthdate','Campaign Name','Billable Impressions','Total Cost']
summary_18 = pd.DataFrame(columns =columns )
for i in range(1,13):
    name  = 'invoice_18_' + str(i)
    locals()[name]=i
    name = pd.read_excel(folder + invoice_file, 'Invoice - ' + cl.month_abbr[i] + ' - 2018')
    name = name.rename(columns = {'Total cost':'Total Cost'})
    name = name[(name['Organization'] == 'iHeartMedia') & (name['Total Cost'] > 0)][['Campaign Name','Billable Impressions','Total Cost']]
    name.insert(0,'Monthdate','2018-0'+str(i)+'-01')
    summary_18 = summary_18.append(name,sort = False)

In [44]:
summary_18.shape[0]

13200

In [47]:
##2019
columns = ['Monthdate','Campaign Name','Billable Impressions','Total Cost']
summary_19 = pd.DataFrame(columns =columns )
for i in range(1,13):
    name  = 'invoice_19_' + str(i)
    locals()[name]=i
    name = pd.read_excel(folder + invoice_file, 'Invoice - ' + cl.month_abbr[i] + ' - 2019')
    name = name.rename(columns = {'Total cost':'Total Cost'})
    name = name[(name['Organization'] == 'iHeartMedia') & (name['Total Cost'] > 0)][['Campaign Name','Billable Impressions','Total Cost']]
    name.insert(0,'Monthdate','2019-0'+str(i)+'-01')
    summary_19 = summary_19.append(name,sort = False)

In [48]:
summary_19.shape[0]

41264

In [49]:
##2020
columns = ['Monthdate','Campaign Name','Billable Impressions','Total Cost']
summary_20 = pd.DataFrame(columns =columns )
for i in range(1,5):
    name  = 'invoice_20_' + str(i)
    locals()[name]=i
    name = pd.read_excel(folder + invoice_file, 'Invoice - ' + cl.month_abbr[i] + ' - 2020')
    name = name.rename(columns = {'Total cost':'Total Cost'})
    name = name[(name['Organization'] == 'iHeartMedia') & (name['Total Cost'] > 0)][['Campaign Name','Billable Impressions','Total Cost']]
    name.insert(0,'Monthdate','2020-0'+str(i)+'-01')
    summary_20 = summary_20.append(name,sort = False)

In [50]:
summary_20.shape[0]

10271

In [51]:
summary = pd.concat([summary_16,summary_17,summary_18,summary_19,summary_20])
summary.shape[0]

70978

In [53]:
summary.to_excel(folder + '/IHM 16.6_20.4 Summary.xlsx', index = False)